Repository: carlosgutierrezlopez/Simula3MS-Swift
Catalog: Localizable.xcstrings
Source language: en
Languages: ar, br, cs, cy, da, de, el, es, et, fa, fi, fr, ga, gd, gl, he, hi, hr, it, ja, ko, kw, lt, lv, nb, nl, pl, pt_pt, ro, sv, uk, zh_hans

# cfg.functional.title
source: FUNCTIONAL UNITS
ar: الوحدات الوظيفية
br: UNANENNOÙ ARC’HWEZH
cs: FUNKČNÍ JEDNOTKY
cy: UNEDAU SWYDDOGAETHOL
da: FUNKTIONELLE ENHEDER
de: FUNKTIONSEINHEITEN
el: ΛΕΙΤΟΥΡΓΙΚΕΣ ΜΟΝΑΔΕΣ
es: UNIDADES FUNCIONALES
et: FUNKTSIONAALSED ÜKSUSED
fa: واحدهای عملکردی
fi: FUNKTIONAALISET YKSIKÖT
fr: UNITÉS FONCTIONNELLES
ga: AONAID FHEIDHMIÚLA
gd: AONAID GHNÌOMHACHAIL
gl: UNIDADES FUNCIONAIS
he: יחידות פונקציונליות
hi: कार्यात्मक इकाइयाँ
hr: FUNKCIONALNE JEDINICE
it: UNITÀ FUNZIONALI
ja: 機能ユニット
ko: 기능 유닛
kw: UNNEDHYOW OBEREL
lt: FUNKCINIAI VIENETAI
lv: FUNKCIONĀLĀS VIENĪBAS
nb: FUNKSJONELLE ENHETER
nl: FUNCTIONELE EENHEDEN
pl: JEDNOSTKI FUNKCYJNE
pt_pt: UNIDADES FUNCIONAIS
ro: UNITĂȚI FUNCȚIONALE
sv: FUNKTIONELLA ENHETER
uk: ФУНКЦІОНАЛЬНІ БЛОКИ
zh_hans: 功能单元

# cfg.int
source: Int
ar: صحيح
fa: صحیح
ga: Slánuimhir
he: שלם
hi: पूर्णांक
ja: 整数
ko: 정수
zh_hans: 整型

# cfg.latency
source: Latency
ar: الكمون
br: Dale
cs: Latence
cy: Oedi
da: Latens
de: Latenz
el: Καθυστέρηση
es: Latencia
et: Latentsus
fa: تأخیر
fi: Latenssi
fr: Latence
ga: Moill
gd: Dàil
gl: Latencia
he: שהייה
hi: लेटेंसी
hr: Latencija
it: Latenza
ja: レイテンシ
ko: 지연 시간
kw: Dall
lt: Vėlinimas
lv: Latence
nb: Latens
nl: Latentie
pl: Opóźnienie
pt_pt: Latência
ro: Latență
sv: Latens
uk: Затримка
zh_hans: 延迟

# cfg.loadFP
source: Load FP
ar: تحميل FP
br: Kargañ FP
fa: بارگذاری FP
ga: Lódáil FP
he: טעינה FP
hi: लोड FP
ja: ロード FP
ko: 로드 FP
zh_hans: 加载 FP

# cfg.mul
source: Multiplication
ar: ضرب
br: Liesaat
cs: Násobení
cy: Lluosi
da: Multiplikation
de: Multiplikation
el: Πολλαπλασιασμός
es: Multiplicación
et: Korrutamine
fa: ضرب
fi: Kertolasku
ga: Iolrú
gd: Iomadachadh
gl: Multiplicación
he: כפל
hi: गुणा
hr: Množenje
it: Moltiplicazione
ja: 乗算
ko: 곱셈
kw: Lieshe
lt: Daugyba
lv: Reizināšana
nb: Multiplikasjon
nl: Vermenigvuldiging
pl: Mnożenie
pt_pt: Multiplicação
ro: Înmulțire
sv: Multiplikation
uk: Множення
zh_hans: 乘法

# cfg.multFP
source: Mult FP
ar: ضرب FP
br: Lies FP
fa: ضرب FP
ga: Iolrú FP
he: כפל FP
hi: गुणा FP
ja: 乗算 FP
ko: 곱셈 FP
pl: Mnoż. FP
zh_hans: 乘法 FP

# cfg.multicycle.title
source: MULTI-CYCLE
ar: متعدد الدورات
br: LIES-TRO
cs: VÍCECYKLOVÝ
cy: AML-GYLCH
da: FLERCYKLUS
de: MEHRZYKLUS
el: ΠΟΛΥΚΥΚΛΙΟ
es: MULTICICLO
et: MITMETSÜKLILINE
fa: چندچرخه
fi: MONISYKLI
ga: ILTIMTHRIALl
gd: IOMA-CHEARCALL
gl: MULTICICLO
he: רב-מחזורי
hi: बहुचक्र
hr: VIŠECIKLIČKI
it: MULTICICLO
ja: マルチサイクル
ko: 멀티사이클
kw: LIES-KELGH
lt: KELIŲ CIKLŲ
lv: DAUDZCIKLU
nb: FLERSYKLUS
nl: MEERCYCLUS
pl: WIELOCYKLOWY
pt_pt: MULTICICLO
ro: MULTICICLU
sv: FLERCYKEL
uk: БАГАТОЦИКЛОВИЙ
zh_hans: 多周期

# cfg.scoreboard.title
source: SCOREBOARD
ar: لوحة النتائج
es: MARCADOR
fa: تابلوی امتیاز
gl: MARCADOR
hi: स्कोरबोर्ड
ja: スコアボード
ko: 스코어보드
pl: TABLICA WYNIKÓW
zh_hans: 记分牌

# cfg.segmented.no
source: Non-segmented
ar: غير مجزأة
br: Nann-rannet
cs: Nesegmentované
cy: Heb eu segmentu
da: Ikke-segmenterede
de: Nicht segmentiert
el: Μη τμηματοποιημένες
es: No segmentadas
et: Segmenteerimata
fa: غیربخش‌بندی‌شده
fi: Segmentoimattomat
fr: Non segmentées
ga: Neamhdheighilte
gd: Gun earrann
gl: Non segmentadas
he: ללא מסגור
hi: अविभाजित
hr: Nesegmentirane
it: Non segmentate
ja: 非パイプライン
ko: 비세그먼트
kw: Heb derivya
lt: Nesegmentuoti
lv: Nesegmentētas
nb: Ikke-segmenterte
nl: Niet gepijplijnd
pl: Niepotokowe
pt_pt: Não segmentadas
ro: Nesegmentate
sv: Icke-segmenterade
uk: Несегментовані
zh_hans: 非分段

# cfg.segmented.yes
source: Segmented
ar: مجزأة
br: Rannet
cs: Segmentované
cy: Wedi’u segmentu
da: Segmenterede
de: Segmentiert
el: Τμηματοποιημένες
es: Segmentadas
et: Segmenteeritud
fa: بخش‌بندی‌شده
fi: Segmentoidut
fr: Segmentées
ga: Deighilte
gd: Earranta
gl: Segmentadas
he: ממוסגרות
hi: विभाजित
hr: Segmentirane
it: Segmentate
ja: パイプライン化
ko: 세그먼트됨
kw: Derivys
lt: Segmentuoti
lv: Segmentētas
nb: Segmenterte
nl: Gepijplijnd
pl: Potokowe
pt_pt: Segmentadas
ro: Segmentate
sv: Segmenterade
uk: Сегментовані
zh_hans: 分段

# cfg.storeFP
source: Store FP
ar: تخزين FP
br: Staliañ FP
fa: ذخیره FP
ga: Stóráil FP
he: שמירה FP
hi: स्टोर FP
ja: ストア FP
ko: 스토어 FP
zh_hans: 存储 FP

# cfg.units
source: Units
ar: الوحدات
br: Unanennoù
cs: Jednotky
cy: Unedau
da: Enheder
de: Einheiten
el: Μονάδες
es: Unidades
et: Üksused
fa: واحدها
fi: Yksiköt
fr: Unités
ga: Aonaid
gd: Aonaidean
gl: Unidades
he: יחידות
hi: इकाइयाँ
hr: Jedinice
it: Unità
ja: ユニット
ko: 유닛
kw: Unnedyow
lt: Vienetai
lv: Vienības
nb: Enheter
nl: Eenheden
pl: Jednostki
pt_pt: Unidades
ro: Unități
sv: Enheter
uk: Блоки
zh_hans: 单元

# datapath.monocycle
source: Single-cycle
ar: أحادي الدورة
br: Unan-dro
cs: Jednocyklový
cy: Un cylch
da: Enkeltcyklus
de: Einzyklus
el: Μονοκύκλιο
es: Monociclo
et: Ühetsükliline
fa: تک‌چرخه
fi: Yksisykli
fr: Monocycle
ga: Aon timthriall
gd: Aon chearcall
gl: Monociclo
he: מחזור יחיד
hi: एकल चक्र
hr: Jednociklički
it: Monociclo
ja: 単一サイクル
ko: 단일 사이클
kw: Unn kelgh
lt: Vieno ciklo
lv: Viena cikla
nb: Énsyklus
nl: Eencyclus
pl: Jednocyklowy
pt_pt: Monociclo
ro: Monociclu
sv: Encykel
uk: Одноцикловий
zh_hans: 单周期

# datapath.multicycle
source: Multi-cycle
ar: متعدد الدورات
br: Lies-dro
cs: Vícecyklový
cy: Aml-gylch
da: Flercyklus
de: Mehrzyklus
el: Πολυκύκλιο
es: Multiciclo
et: Mitmetsükliline
fa: چندچرخه
fi: Monisykli
ga: Iltimthriall
gd: Ioma-chearcall
gl: Multiciclo
he: רב-מחזורי
hi: बहुचक्र
hr: Višeciklički
it: Multiciclo
ja: マルチサイクル
ko: 멀티사이클
kw: Lies-kelgh
lt: Kelių ciklų
lv: Daudzciklu
nb: Flersyklus
nl: Meertraps
pl: Wielocyklowy
pt_pt: Multiciclo
ro: Multiciclu
sv: Flercykel
uk: Багатоцикловий
zh_hans: 多周期

# datapath.segmented
source: Pipelined
ar: مجزأ
br: Rannet
cs: Segmentovaný
cy: Wedi’i biblinellu
da: Pipelinet
de: Pipeline
el: Τμηματοποιημένο
es: Segmentado
et: Segmenteeritud
fa: بخش‌بندی‌شده
fi: Putkitettu
fr: Pipeline
ga: Deighilte
gd: Earranta
gl: Segmentado
he: מפולח
hi: विभाजित
hr: Segmentirani
it: Pipeline
ja: パイプライン
ko: 파이프라인
kw: Derivys
lt: Segmentuotas
lv: Segmentēts
nb: Pipelinet
nl: Gepijplijnd
pl: Potokowy
pt_pt: Segmentado
ro: Segmentat
sv: Pipeline
uk: Конвеєрний
zh_hans: 流水线

# find.placeholder
source: Text to find
ar: النص المطلوب البحث عنه
br: Testenn da glask
cs: Text k vyhledání
cy: Testun i’w chwilio
da: Tekst at søge efter
de: Zu suchender Text
el: Κείμενο προς αναζήτηση
es: Texto a buscar
et: Otsitav tekst
fa: متن برای جستجو
fi: Etsittävä teksti
fr: Texte à rechercher
ga: Téacs le cuardach
gd: Teacsa ri lorg
gl: Texto a buscar
he: טקסט לחיפוש
hi: खोजने के लिए पाठ
hr: Tekst za pretraživanje
it: Testo da cercare
ja: 検索するテキスト
ko: 찾을 텍스트
kw: Text dhe whilas
lt: Ieškomas tekstas
lv: Meklējamais teksts
nb: Tekst å søke etter
nl: Tekst om te zoeken
pl: Tekst do znalezienia
pt_pt: Texto a procurar
ro: Text de căutat
sv: Text att söka efter
uk: Текст для пошуку
zh_hans: 要查找的文本

# find.title
source: Find
ar: بحث
br: Klask
cs: Hledat
cy: Chwilio
da: Søg
de: Suchen
el: Αναζήτηση
es: Buscar
et: Otsi
fa: جستجو
fi: Etsi
fr: Rechercher
ga: Cuardaigh
gd: Lorg
gl: Buscar
he: חיפוש
hi: खोज
hr: Traži
it: Cerca
ja: 検索
ko: 찾기
kw: Whilas
lt: Ieškoti
lv: Meklēt
nb: Søk
nl: Zoek
pl: Znajdź
pt_pt: Procurar
ro: Caută
sv: Sök
uk: Пошук
zh_hans: 查找

# goto.title
source: Go to Line
ar: الانتقال إلى السطر
br: Mont d’al linenn
cs: Přejít na řádek
cy: Mynd i linell
da: Gå til linje
de: Gehe zu Zeile
el: Μετάβαση στη γραμμή
es: Ir a línea
et: Mine reale
fa: رفتن به خط
fi: Siirry riville
fr: Aller à la ligne
ga: Téigh go líne
gd: Rach gu loidhne
gl: Ir á liña
he: עבור לשורה
hi: पंक्ति पर जाएँ
hr: Idi na redak
it: Vai alla riga
ja: 行へ移動
ko: 줄로 이동
kw: Mos dhe’n linenn
lt: Eiti į eilutę
lv: Doties uz rindu
nb: Gå til linje
nl: Ga naar regel
pl: Przejdź do wiersza
pt_pt: Ir para a linha
ro: Mergi la linie
sv: Gå till rad
uk: Перейти до рядка
zh_hans: 跳转到行
